{
    "basics" : {
        "name" : "Robert Rees",
        "website" : "http://rrees.me",
        "summary" : "A technical manager with hands-on development experience and all-round project and business experience. I want to try and do interesting things with nice people.",
        "label": "I am a lover of programming and systems thinking",
        "picture": "https://secure.gravatar.com/avatar/cc171a7166f9c65ce83703fe9cbc9448",
        "location" : {
            "city" : "London"
        },
        "profiles" : [
            {
            "network" : "twitter",
            "username" : "rrees",
            "url" : "https://twitter.com/rrees"
            },
            {
                "network": "Github",
                "username": "rrees",
                "url": "https://github.com/rrees"
            }
        ]
    },
    "education" : [{
        "institution" : "University of Bristol",
        "area" : "Mathematics",
        "startDate": "1993-09-01",
        "endDate": "1996-06-01"
    }],
    "interests" : [
        {
            "name": "Reading non-fiction",
            "keywords": ["History", "Biography", "Political and Economic theory"]
        },
        {
            "name": "Learning to play music",
            "keywords": ["Guitar", "Ukulele"]
        },
        {
            "name": "Karaoke",
            "keywords": ["Pub singer"]
        },
        {
            "name" : "Technical pencils",
            "keywords" : ["Stationary"]
        }
    ],
    "work" : [
        {
            "company" : "The Guardian",
            "position" : "Senior engineering manager",
            "summary": "I manage and coach developers as well as contributing to project delivery and writing software. I have worked on a number of specific projects at the Guardian but currently I the development manager for the Editorial Tools team. We produce and maintain all the digital content management and publication tools for journalists.",
            "startDate": "2012-05-01",
            "highlights": [
                "Created the Guardian's Fellowship programme to create a way for people from non-traditional development backgrounds to join the Guardian's development team",
                "Designed and lead the project to move all content to a single CMS",
                "Built the Guardian's Glass application",
                "Created new recruitment processes for client-side and general software developers",
                "Growth-hacking to try and look at qualified opportunities to grow reach on the Web",
                "Moved the Guardian's legacy products from a two-week release cycle to on-demand delivery",
                "SEO implementation, monitoring, optimisation and internationalisation"
            ]
        },
        {
            "company": "Wazoku",
            "position": "Chief Technology Officer",
            "startDate": "2011-05-01",
            "endDate": "2012-05-01",
            "summary": "I was the first employee with Wazoku and oversaw the creation of a number of the initial iterations of the product including variants of the base product to support competitions and student business pitches. I also hired and formed the initial permanent tech team there. After leaving the firm I remain an investor and have helped out as needed on the technical side of the business.",
            "highlights": [
                "First permanent employee",
                "Created the development team from nothing",
                "Pivoted our product into competitions"
            ]
        },
        {
            "company": "ThoughtWorks",
            "position": "Senior consultant",
            "startDate": "2008-01-03",
            "endDate": "2011-04-01",
            "summary": "I had the opportunity to work with a number of interesting clients from many sectors. I mostly dealt with delivery transformation and management support for things like takeovers or strategy validation. I did also get to do some fun work prototyping and validating business prospects."
        },
        {
            "company": "Blueheath",
            "position": "Team lead",
            "startDate": "2006-09-24",
            "endDate": "2007-12-12",
            "summary": "Blueheath was a just-in-time supplier of ambient grocery goods. It allowed small retailers to order on a 24-hour cycle rather than the industry standard of weekly or longer. I joined the company when it was going through a number of changes and ended up being in charge of the tech team there as we negotiated a reverse takeover by industry leader Booker."
        },
        {
            "company": "Carphone Warehouse",
            "position": "Developer",
            "startDate": "2004-12-01",
            "endDate": "2006-09-01",
            "summary": "I worked on the European Insurance product that allowed point of sale registration of insurance for new purchases. I had to implement the country-specific requirements and payment options while ensuring back-office compatibility with the original UK insurance flow."
        },
        {
            "company": "Convergys",
            "position": "Senior developer",
            "startDate": "1997-02-01",
            "endDate": "2004-11-01",
            "summary": "I implemented billing of SMS and later GPRS services for customers in the UK and Germany. This period saw an explosive growth in use of both services and a rapid evolution in the both the underlying hardware of the switching systems used and the associated business and billing model."
        }
    ],
    "skills": [
        {
            "name": "Software development",
            "keywords": [
                "Python",
                "Javascript",
                "Java",
                "Clojure"
            ]
        },
        {
            "name": "Web development",
            "keywords": [
                "HTML",
                "CSS",
                "Javascript"
            ]
        },
        {
            "name": "Management",
            "keywords": [
                "Coaching",
                "Staff development",
                "Mentoring"
            ]
        },
        {
            "name": "Recruitment",
            "keywords": [
                "Developing organic lead pipelines",
                "Interview processes",
                "Pair programming tests"
            ]
        },
        {
            "name": "Software delivery",
            "keywords": [
                "planning",
                "strategy",
                "resolving tactical blockers",
                "alignment with organisational goals",
                "pace improvement",
                "incremental and continuous delivery"
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "London Clojurians",
            "position": "Co-founder and admin",
            "summary": "I helped setup the Clojurians group and helped organise and run its first few years of meetings until a larger organising group was formed."
        },
        {
            "organization": "Fullstack conference",
            "position": "Program committee",
            "summary": "Reviewed talk applications, made recommendations about selections and provided feedback for speakers"
        },
        {
            "organization": "Clojure Exchange conference",
            "position": "Program committee",
            "summary": "Reviewed talk applications, made talk selections, provided feedback for speakers and contributed to the programme schedule"
        }
    ]
}
