{
    "basics" : {
        "name" : "Robert Rees",
        "website" : "http://rrees.me",
        "summary" : "I am an experienced technology leader with skills across development, product management, operational delivery and people management. I'm looking for a role that can provide the chance to use the cross-functional skills in a mission-orientated company.",
        "label": "I like programming and systems thinking",
        "picture": "https://secure.gravatar.com/avatar/cc171a7166f9c65ce83703fe9cbc9448",
        "location" : {
            "city" : "London"
        },
        "profiles" : [
            {
                "network" : "Mastodon",
                "username" : "rrees",
                "url" : "https://mastodon.social/rrees"
            },
            {
                "network": "Github",
                "username": "rrees",
                "url": "https://github.com/rrees"
            },
            {
                "network": "DevTo",
                "username": "rrees",
                "url": "https://dev.to/rrees/"
            },
            {
                "network": "LinkedIn",
                "username": "therobertrees",
                "url": "https://www.linkedin.com/in/therobertrees/"
            }
        ]
    },
    "education" : [{
        "institution" : "University of Bristol",
        "area" : "Mathematics",
        "startDate": "1993-09-01",
        "endDate": "1996-06-01"
    }],
    "interests" : [
        {
            "name": "Reading non-fiction",
            "keywords": ["History", "Biography", "Political and Economic theory"]
        },
        {
            "name": "Karaoke",
            "keywords": ["Pub singer"]
        },
        {
            "name": "Gaming",
            "keywords": ["Boardgames", "Computer games", "Gamebooks"]
        },
        {
            "name" : "Technical pencils",
            "keywords" : ["Stationary"]
        }
    ],
    "work" : [
        {
            "name": "loveholidays",
            "url": "https://www.loveholidays.com/",
            "position": "Lead Developer",
            "startDate": "2023-06-06",
            "summary": "I am the technical lead of the Customer Experience Technology team at *loveholidays* which supports the technology underpinnings of our Customer Experience team. This includes responsibility for managing external suppliers and integrating different tools into a cohesive technical solution. My team also has responsibility for the Conversation AI solutions that we use to manage initial customer contact and ideally try to resolve problems through scalable technical solutions.",
            "highlights": [
                "Completing the delivery of new telephony service to the contact centre and sales teams including a new virtual agent to manage credit card authorisations",
                "Delivering automation of new work processes in the contact centre delivering substantial reductions in the time spent by customers (around five minutes of face time) and halving handling times for agents handling supplier interactions"
            ]
        },
        {
            "name": "Counting Up",
            "url": "https://countingup.com/",
            "position": "Engineering Manager",
            "startDate": "2022-10-31",
            "endDate": "2023-01-31",
            "summary": "I joined *Counting Up* to help the company explore a management structure that could help scale up the company for an anticipated funding round. While there I worked in a team that was creating a new web portal for customers to have a large screen experience for accessing their accounts and that made use of the existing app-based authentication process."
        },
        {
            "name": "We Got POP",
            "position": "Senior Vice President of Technology",
            "startDate": "2017-05-06",
            "endDate": "2022-10-21",
            "summary": "I joined We Got POP when it was a successful but still relatively small business and was part of its journey through a Series A fundraise to acquisition and ultimately a realisation of a business that dominates its niche in both the US and the UK and has changed the way that background casting is done in the industry.",
            "highlights": [
                "Tripling the technology group headcount to around 30 people in various roles and creating a great team who were able to deliver our software vision",
                "Achieving above-average gender balance in the development team across all seniorities",
                "Meeting aggressive hiring targets in support of our delivery goals",
                "Launching our Casting product into the US and Ireland",
                "Completing a multi-year technology replatforming and migration for Central Casting allow expansion into new territories",
                "Maturing our infosec processes and capabilities to allow us to acquire the largest of enterprise customers like Sony and Disney",
                "Developing our data protection and handling policies",
                "Supporting our platform growth from expanded from six figure monthly transaction volumes to 10 figures over three years. Going from a UK only business to one operating across Europe and coast to coast in the US.",
                "Launching an entirely new product line in scripted drama going from zero to a substantial market share in just a few years"
            ]
        },
        {
            "name" : "Government Digital Service",
            "url": "https://www.gov.uk/government/organisations/government-digital-service",
            "position" : "Head of the technical architecture community",
            "summary" : "I was the community lead for technical architecture discipline within both GDS and across government working as part of the Chief Architect's office.",
            "startDate": "2016-08-01",
            "endDate": "2017-05-01",
            "highlights": [
                "Defined the role and career progression for technical architects in government and aligned it with the equivalent definition for software engineers",
                "Led recruiting for technical architects and leaders in GDS and other parts of government. Revamping the process and developing a better leads pipeline",
                "Organised a government-wide conference for technologists",
                "Handled line management and project placement for technical architects",
                "Organised training courses for the community to help members meet the corporate expectations of technical leaders",
                "Organised away days for the broader technology community",
                "Facilitated communication and collaboration across government for technical leaders"
            ]
        },
        {
            "name": "The Guardian",
            "url": "https://www.theguardian.com/",
            "position" : "Senior engineering manager",
            "summary": "I managed and coached developers as well as contributing to project delivery and writing software. I worked on a number of specific projects at the Guardian but in my last role I was the development manager for the Editorial Tools team, which build and maintained the digital content management and publication tools for journalists.",
            "startDate": "2012-05-01",
            "endDate": "2016-06-30",
            "highlights": [
                "Created the Guardian's Fellowship programme to create a way for people from non-traditional development backgrounds to join the Guardian's development team",
                "Created a more autonomous working environment by empowering developers to understand the business problems and user needs themselves and enabling them to deliver solutions independently",
                "Designed and lead the project to move all content to a single CMS",
                "Built the Guardian's Glass application",
                "Created new recruitment processes for client-side and general software developers",
                "Growth-hacking to try and look at qualified opportunities to grow reach on the Web",
                "Moved the Guardian's legacy products from a two-week release cycle to on-demand delivery",
                "SEO implementation, monitoring, optimisation and internationalisation"
            ]
        },
        {
            "name": "Wazoku",
            "url": "https://www.wazoku.com/",
            "position": "Chief Technology Officer",
            "startDate": "2011-05-01",
            "endDate": "2012-05-01",
            "summary": "I was the first employee with Wazoku and oversaw the creation of a number of the initial iterations of the product including variants of the base product to support competitions and student business pitches. I also hired and formed the initial permanent tech team there. After leaving the firm I remain an investor and have helped out as needed on the technical side of the business.",
            "highlights": [
                "First permanent employee",
                "Created the development team from nothing",
                "Built the initial idea management technology platform",
                "Pivoted our product into competitions"
            ]
        },
        {
            "name": "ThoughtWorks",
            "url": "https://www.thoughtworks.com/",
            "position": "Senior consultant",
            "startDate": "2008-01-03",
            "endDate": "2011-04-01",
            "summary": "I had the opportunity to work with a number of interesting clients from many sectors. I mostly dealt with delivery transformation and management support for things like takeovers or strategy validation. I did also get to do some fun work prototyping and validating business prospects.",
            "highlights": [
                "Spent over a year with the BBC on the redesign and redevelopment of the news site",
                "Supported BioMed Central in their switch to an agile delivery process",
                "Consulted with Symbian on how to change their developer tooling and relationship management as a result of the iPhone",
                "Created rapid prototypes for clients over legacy datasets using techniques like daily iterations and intercepting data transformation"
            ]
        },
        {
            "name": "Blueheath",
            "position": "Team lead",
            "startDate": "2006-09-24",
            "endDate": "2007-12-12",
            "summary": "Blueheath was a just-in-time supplier of ambient grocery goods. It allowed small retailers to order on a 24-hour cycle rather than the industry standard of weekly or longer. I joined the company when it was going through a number of changes and ended up being in charge of the tech team there as we negotiated a reverse takeover by industry leader Booker."
        },
        {
            "name": "Carphone Warehouse",
            "position": "Developer",
            "startDate": "2004-12-01",
            "endDate": "2006-09-01",
            "summary": "I worked on the European Insurance product that allowed point of sale registration of insurance for new purchases. I had to implement the country-specific requirements and payment options while ensuring back-office compatibility with the original UK insurance flow."
        },
        {
            "name": "Convergys",
            "position": "Senior developer",
            "startDate": "1997-02-01",
            "endDate": "2004-11-01",
            "summary": "I implemented billing of SMS and later GPRS services for customers in the UK and Germany. This period saw an explosive growth in use of both services and a rapid evolution in the both the underlying hardware of the switching systems used and the associated business and billing model."
        }
    ],
    "skills": [
        {
            "name": "Software development",
            "keywords": [
                "Python",
                "Javascript/Typescript",
                "Clojure",
                "Go"
            ]
        },
        {
            "name": "Web development",
            "keywords": [
                "HTML",
                "CSS",
                "Javascript"
            ]
        },
        {
            "name": "Management",
            "keywords": [
                "Coaching",
                "Staff development",
                "Mentoring"
            ]
        },
        {
            "name": "Recruitment",
            "keywords": [
                "Developing organic lead pipelines",
                "Interview processes",
                "Assessment criteria",
                "Pair programming tests"
            ]
        },
        {
            "name": "Software delivery",
            "keywords": [
                "Planning and program management",
                "Strategy",
                "Resolving technical blockers",
                "Aligning delivery with organisational objectives",
                "Pace improvement",
                "Build automation",
                "Incremental and continuous delivery"
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "London Clojurians",
            "position": "Co-founder and admin",
            "summary": "I helped setup the Clojurians group and helped organise and run its first few years of meetings until a larger organising group was formed.",
            "startDate": "2009-10-01",
            "endDate": "2013-01-01"
        },
        {
            "organization": "Fullstack conference",
            "position": "Program committee",
            "summary": "Reviewed talk applications, made recommendations about selections and provided feedback for speakers",
            "startDate": "2015-03-01",
            "endDate": "2019-11-01"
        },
        {
            "organization": "Clojure Exchange conference",
            "position": "Program committee",
            "summary": "Reviewed talk applications, made talk selections, provided feedback for speakers and contributed to the programme schedule",
            "startDate": "2012-05-01",
            "endDate": "2019-11-01"
        }
    ]
}
